{
  "GuideData": {
    "AdsController": 
      {
        "NetworkAds": "mopub",

        "BannerAdmob": "ca-app-pub-3940256099942544/6300978111",
        "InterstitialAdmob": "ca-app-pub-3940256099942544/1033173712",
        "NativeAdmob": "ca-app-pub-3940256099942544/2247696110",
		
		"mopubBanner" : "b195f8dd8ded45fe847ad89ed1d016da",
		"mopubInter" : "24534e1901884e398f1253216226017e",
		"mopubNative" : "11a17b188668469fb0412708c3d16813",

        "ImageBanner": false,
        "ImageBannerImg" : "https://media3.giphy.com/media/igVvRDJ4EbhstQyEKh/giphy.gif",
        "ImageBannerURL" : "https://www.google.com"
		
      },
    "items": [
      {
        "title": "Mincraft House",
	"titleSec": "Best Mincraft Houses",
	"imageSecOne": "https://raw.githubusercontent.com/XWGAMES/mockJson/main/BestHouse.jpeg",
	"imageSecTwo": "https://raw.githubusercontent.com/XWGAMES/mockJson/main/HouseBasics.jpg",
	"imageSecThree": "https://raw.githubusercontent.com/XWGAMES/mockJson/main/UndergroundHouse.jpg",
	"imageSecFour": "https://raw.githubusercontent.com/XWGAMES/mockJson/main/OvergroundHouse.jpg", 
	"titleSecOne": "How to build the best Mincraft house ",
	"titleSecTwo": "How to build a Mincraft house: The Basics",
	"titleSecThree": "How to build a Mincraft house: Underground",
	"titleSecFour": "How to build a Mincraft house: Overground", 
	"textSecOne": "If you are looking for a place to hide from night terrors or to hide your collected treasures, you must know how to build a Minecraft house. Not only does this give you a safe place to rest and relax, it also serves as a base for Minecraft where you can craft new items, respawn in the world, or just watch the world go by outside. When deciding how to build a Minecraft house, you have two main options, each with its pros and cons. If you want to keep things flat then digging into the side of a hill or straight into the ground will mean your home is much less prone to attack, although from the outside it's not much to look at. Alternatively, you can use materials to create a standard build on the surface, which means you can make your Minecraft house as impressive and ornate as your imagination allows, but it\'s more exposed to Creepers coming in and blowing things up. ..",
	"textSecTwo": "Regardless of how you build your Minecraft house, there are a number of essential items you need to make sure of. To begin with, be sure to place plenty of torches around the area, as they serve two important purposes. Firstly, they allow you to see what's going on inside, which is especially useful if you are carving out a cave, and secondly, they help ward off monsters as they mostly spawn in dark areas. By placing a generous number of torches inside and outside your home, you can dramatically reduce the chances that a monster seems to ruin your day.Next, build a bed in your Minecraft house, so that you can sleep through the night and wake up fresh in the safety of the morning. Most importantly, a bed serves as a spawn point in the world, so if the worst happens you'll revive home rather than the set world spawn point, which will at least earn you a trip back to it for. pick up where to leave behind.",
	"textSecThree": "To start in a Minecraft underground house, ideally you'll dig horizontally into the side of a hill - if the terrain isn't suitable, you can dig down instead, but that makes the construction a bit trickier. You don't want to make your driveway too big, so carve a tunnel one block wide and two blocks high that goes at least a few blocks deep into the surrounding area. At the end of this tunnel, you can then start digging outward to build your first room, then glue some torches to get a proper overview of what you're doing and add the other basics we've outlined below- above. As well as providing a well-protected bunker for living inside, you can also continue to dig further around to collect materials without having to return to the surface. When you walk away from your home, be sure to place a back door and additional lighting to keep your accommodations safe and monster free.",
	"textSecFour": "This is probably the type of Minecraft house that most players are familiar with because they are much more visible and you can build some really impressive structures. Any material can be used to build the walls, but solid material like stone will provide a stronger foundation than wood. For starters, you'll want to clear out a flat area to build on, which can be as large as you want, but around a dozen square blocks is a good place to start so you don't run out of space too quickly - you can still expand. later if necessary. Then build walls around the perimeter at least four blocks high, leaving space for a door and any windows you want to install - be sure to fill them in with the appropriate panels. For a roof, you can either go with a flat sheet of blocks, stack them at an angle, or even use stairs to achieve the traditional sloping look. Outside, consider ringing your Minecraft house with a fence to keep all marauding monsters at bay, with plenty of torches to keep them away. Add all of the basics we discussed earlier, and your property is good to go.Then build walls around the perimeter at least four blocks high, leaving space for a door and any windows you want to install - be sure to fill them in with the appropriate panels. For a roof, you can either go with a flat sheet of blocks, stack them at an angle, or even use stairs to achieve the traditional sloping look. Outside, consider ringing your Minecraft house with a fence to keep all marauding monsters at bay, with plenty of torches to keep them away. Add all of the basics we discussed earlier, and your property is good to go.",
        "image": "https://raw.githubusercontent.com/XWGAMES/mockJson/main/BestHouse.jpeg",
	"color": "#000000",
        "text_size": "25",
        "isLink": true,
	"link_title": "Best Mincraft House",
	"setLink": "",
        "image_link": "",
        "text": "Setting yourself up with a great Minecraft house is very important, as it provides you with a safe refuge away from any creatures and a place to store all of your hard-earned gear and treasure. \n Plus, you can show off your creative flair by making your home as impressive as you like.",
        "isNative": false,
	"background": "#999999"
      },
      {
        "title": "Minecraft commands and cheats",
	"titleSec": "Minecraft commands and cheats",
	"imageSecOne": "https://raw.githubusercontent.com/XWGAMES/mockJson/main/LocalisationComm.png",
	"imageSecTwo": "https://raw.githubusercontent.com/XWGAMES/mockJson/main/ControlsVariousOptions.png",
	"imageSecThree": "https://raw.githubusercontent.com/XWGAMES/mockJson/main/Materiels.png",
	"imageSecFour": "https://raw.githubusercontent.com/XWGAMES/mockJson/main/Cooking.png",
	"titleSecOne": "Location commands",
	"titleSecTwo": "Controls with various options",
	"titleSecThree": "List of main materials in Minecraft",
	"titleSecFour": "How to cook in Minecraft", 
	"textSecOne": "A special type of commands in Minecraft are the locate commands. In the game we have the possibility to locate a certain area in the plane or the world, so that it is easier for us to access it. There is one command that is to locate that closest area or structure, which we have mentioned in the list, although what interests us first and foremost is the combination for said location, which should be placed after the command , following this structure: / locate [LOCATION] \n Once we know the order, we are interested in what structures or locations can we find, for which there are several possible combinations or options. The sites that can be entered in this command in Minecraft, they are: \n Buried treasure \n Desert_Pyramid \n EndCity \n Fortress \n Igloo \n Jungle_Pyramid \n Chateau \n Mine mine \n Monument \n Ocean_Ruine \n Pillager_Outpost \n Shipwreck \n Bastion \n Swamp_Hut \n Town",
	"textSecTwo": "In the list we have mentioned, there are a few commands which then have multiple levels or options. For example, if you want to change the difficulty of the game in Minecraft, then you can choose the difficulty level you want to play at that time. The same happens with other controls, which have multiple options or levels, such as game mode, times of day, or the time we want it to do while we are playing. Therefore, it is convenient to know what these options or levels are, and then use the desired one in each specific case: \n Game modes \n / game mode 0: Go to survival mode \n / game mode 1: Switch to creation mode \n / game mode 2: Enter adventure mode \n / game mode 3: Switch to spectator mode \n Difficulty \n / peaceful difficulty: Pacific Mode \n / easy difficulty: Easy mode \n / normal difficulty: Normal mode \n / hard difficulty: Hard mode",
	"textSecThree": "In Minecraft we have to get objects with which to do things, is one of the most important aspects of the game. Depending on the area we are in, these materials will be different. We can therefore find quite a few, which are always useful, but logically, there are areas that are more interesting because they have more materials, such as a forest or a mine for example, compared to others such as the desert. , which hardly has anything to offer. \n When looking for minerals, in areas with rocks or mines, you have to take into account the peak you are going to use. There are spikes that will make it take longer to get blocks, so the process may take too long. On the other hand, to create blocks of a mineral, you need several units, and you can also create ingots with them. \n Some main materials that we can find or use in Minecraft are: \n rock \n Coal \n Drink \n gold \n Esmeralda \n diamond (Be careful, because they only give the material if you chop with an iron spike. Wood or stone do not work) \n Iron \n Infra-quartz",
	"textSecFour": "We also have to cook items, which is another aspect that will depend on the recipes used for it. To be able to cook items in Minecraft, we are going to have to create an oven. This is the first step in making this possible so that we can make it possible. \n The oven is made up of two parts: a lower plate and an upper plate. The fuel that we will need to light it and heat it is placed in the lower tray of it and in the upper tray the food. This oven will not only be used for cooking things, because in Minecraft we can also cook our own food, like cooking meat. In addition, we also have all kinds of different recipes, like to be able to make bread and many other things, by mixing ingredients. So we can cook a lot of our food this way.",
        "image": "https://raw.githubusercontent.com/XWGAMES/mockJson/main/Commands.jpg",
	"color": "#000000",
        "text_size": "25",
        "isLink": true,
	"link_title": "Commands and cheats",
	"setLink": "",
        "image_link": "",
        "text": "when you play this popular title, you will find that there are a number of commands which are particularly useful, popular or essential in the game. Thanks to them we will be able to move forward, especially when we take the first steps and go use the game control console, it's good to know which ones we can use or they will come in handy. \n It is therefore essential to be able to know them",
        "isNative": false,
		"background": "#999999"
      },
      {
        "title": "Minecraft servers",
	"titleSec": "Minecraft servers",
	"imageSecOne": "",
	"imageSecTwo": "",
	"imageSecThree": "",
	"imageSecFour": "", 
	"titleSecOne": "",
	"titleSecTwo": "",
	"titleSecThree": "",
	"titleSecFour": "", 
	"textSecOne": "",
	"textSecTwo": "",
	"textSecThree": "",
	"textSecFour": "",
        "image": "https://raw.githubusercontent.com/XWGAMES/mockJson/main/Servers.jpg",
	"color": "#000000",
        "text_size": "25",
        "isLink": false,
	"link_title": "",
	"setLink": "",
        "image_link": "",
        "text": "Minecraft is the second most popular video game in the world: in February 2017, it sold 121 million copies. \n But Minecraft is more than just a multiplayer game. It is also a tool for teaching children to code, an open platform enriched by mod development and it is the competition point of an international community of creators. \n If you're new to Minecraft, the best way to get started is to buy the game and get started. You can even use Minecraft Realms to create your own world - it's a kind of Minecraft host and a lightweight alternative to creating your own private server. \n But if you want the full Minecraft experience, you can take it a step further by launching your own private Minecraft server. With a private server, you are free to create a Minecraft world of your own. \n In this article, we'll show you exactly how. We will see how to create a Minecraft server on a Windows computer, on a Mac, and on a Linux hosting service.\n Ready ? Let's go. \n How to Create a Minecraft Server on Microsoft Windows, Mac, and Linux \n Basically, creating Minecraft servers follows a few basic steps: \n Install the latest version of Java \n Install the latest version of Minecraft server software \n Configure your server and network \n Start the server \n Check that access to your server is possible \n What you need to understand before you get started. \n Setting up a server takes time and effort. You will need some technical knowledge to set up a Minecraft server properly. \n You need to understand the basics of network computing concepts as they are essential to the management of any type of server. \n To be more specific, you should know and be comfortable with: \n The command line \n Networks (IP, DHCP, ports) \n Your system configuration \n Your network configuration \n The configuration of your router (for home installations) \n Running a Minecraft server at home? \n For running a Minecraft game server, a desktop computer is ideal. You don't need an intel xeon processor and an 8TB hdd ... \n On the other hand, to run a Minecraft server and a Minecraft client on the same machine, you need powerful configurations: CPU, RAM, SSD, hard disks, storage space, etc. This is especially true if you are going to install a lot of mods. \n Finally, make sure that your server is connected over Ethernet and not over Wi-Fi. Wired connections are more reliable. \n What if you don't want to host your server at home? \n A physical server hosted in your home exposes your home network to the world. \n If you prefer to avoid taking this risk, you can also resort to a Minecraft server host. Hosts require monthly or yearly payments, but you save yourself the tedious management of server hardware. \n If you are just starting out, a GoDaddy VPS server (shared hosting) will suit your needs. VPS can be managed by you or by GoDaddy. However, remember that with virtualization, you will be sharing hardware with other users. So monitor the use of resources. \n If you need a little more oomph, so that a lot of players can connect, a dedicated hosting might serve you better. GoDaddy Dedicated Servers offer protection against DDoS attacks and work with cPanel or Plesk on CentOS distributions.",
        "isNative": false,
	"background": "#999999"
      },
      {
        "title": " \n \n Mincraft Skins",
        "image": "https://raw.githubusercontent.com/XWGAMES/mockJson/main/MincraftSkins.png",
	"titleSec": " \n \n Best Mincraft Skins",
	"imageSecOne": "https://raw.githubusercontent.com/XWGAMES/mockJson/main/SuperMario.jpg",
	"imageSecTwo": "https://raw.githubusercontent.com/XWGAMES/mockJson/main/Hallowen.PNG",
	"imageSecThree": "https://raw.githubusercontent.com/XWGAMES/mockJson/main/MarvelGardian.png",  
	"imageSecFour": "https://raw.githubusercontent.com/XWGAMES/mockJson/main/simpson.jpg", 
	"titleSecOne": "Super Morio",
	"titleSecTwo": "Halloween",
	"titleSecThree": "Marvel Guardians Of The Galaxy",
	"titleSecFour": "Sinpson", 
	"textSecOne": "This package is very old, but one of the rarest. It was a combination of Mincraft and Nintendo's Super Morio. This edition was accompanied by many characters from Super Morio, such as Mario, Luigi, Princess Peach and even Bowser. The world is filled with giant structures of Super Morio characters and gives a nostalgic feel to the classic music of the background game. It is no longer available on the Mincraft Marketplace, but you can enjoy it if you own the Nintendo Switch.",
	"textSecTwo": "This skin pack was released for a limited time on Halloween to promote action with the charity. This is a very rare skin, first seen in 2012. The Halloween package was well designed, especially the ghost skin with transparent pixels, making them float. Mincraft is one of those rare games that, in addition to providing entertainment, works for noble causes. To raise awareness of the decline of coral reefs, the game launched a pack of skins for a charity. This Halloween pack was released for a limited time and can now barely be found anywhere, with multiple skins, but the scariest part was Evil Lemmy.",
	"textSecThree": "Marvel, along with Spidor-Man, released two more skin packs for the Legacy Edition. The second flagship bundle was the Guardians of the Galaxy theme skins, containing all of the characters from the movie. This package is therefore no longer available, therefore one of the rarest.",
	"textSecFour": "Another skin pack that didn't last long and is exclusively in the Xbox edition. This skin was only available on Mincraft Market Place from 2015 to 2017, being very impressive and available for a few dollars in the store. You can play any character from this well-known sitcom series, which makes fans of the cartoon very happy to have them. Hence, it definitely enters the list of the best Mincraft skins.",
	"color": "#000000",
        "text_size": "25",
        "isLink": false,
	"link_title": "Best Mincraft skins",
	"setLink": "",
        "image_link": "",
        "text": "How can a block game be so popular when there are high end console games with realistic graphics and physics? Whether it's PCs, tablets, mobile phones or consoles, the Mincraft is everywhere. \n \n",
        "isNative": false,
	"background": "#999999"
      },
       {
        "title": "Mincraft texture",
	"titleSec": "Best Minecraft Texture",
	"imageSecOne": "https://raw.githubusercontent.com/XWGAMES/mockJson/main/BitsSouples.jpg",
	"imageSecTwo": "https://raw.githubusercontent.com/XWGAMES/mockJson/main/InfiniteBits.jpg",
	"imageSecThree": "https://raw.githubusercontent.com/XWGAMES/mockJson/main/Faithful.png",
	"imageSecFour": "https://raw.githubusercontent.com/XWGAMES/mockJson/main/GridPixels.png", 
	 "titleSecOne": "Bits souples",
	"titleSecTwo": "InfiniteBits",
	"titleSecThree": "F8thful",
	"titleSecFour": "GridPixels", 
        "textSecOne": "The main feature of Soft Bits is that it takes the normal texture of Minecraft and makes them easier on the eyes. Instead of mixing the pixels, you see clear, distinct edges. You can certainly compare the artistic style of this texture pack to that of the early Super Mario Bros. or Legend of Zelda games. If you have shaders installed, this texture pack will show you how dynamic Minecraft can be.",	       
	"textSecTwo": "InfiniteBits is the only texture pack we've seen that manages to be both simple and detailed. It's a low-res (8x) texture pack that adds the perfect amount of detail to make it still look pretty. The blocks have distinct edges, but not to the point of distraction. This texture pack takes you back to the days when minimalist art was popular and makes you want to stay there.",
	"textSecThree": "F8thful is named as such because it is faithful to Minecraft's default texture pack, but describes it in 8x resolution. We have to assume it was not an easy task, but they do. If you want to run your Minecraft game at a simpler resolution, but don't want to take the edge off the experience, this is the perfect texture pack. It works so well, it's a wonder why Mojang didn't make 8x the default!",
	"textSecFour": "GridPixels is a particular texture pack that seems to oversimplify blocks, especially those with additional effects. Each block has a separate edge. Blocks with animation or transparent space are reduced to squares that blend in well with the surroundings. However, despite the oversimplification, this texture pack is still visually appealing. For Minecraft, it seems fashionable to be square!",
        "image": "https://raw.githubusercontent.com/XWGAMES/mockJson/main/Texture.png",
	"color": "#000000",
        "text_size": "25",
        "isLink": true,
	"link_title": "Best Minecraft Texture",
	"setLink": "",
        "image_link": "",
        "text": "Texture packs that don't add frills (or reduce them) have always been popular in Minecraft because some people like a simplistic look or to improve their FPS. further enhance the look of your Minecraft experience \n Most of the more advanced Minecraft texture packs require the installation of Optifine to work. We strongly recommend that you install it to improve game performance and visual effects if you want to use the resource packs listed here",
        "isNative": false,
	"background": "#999999"
      }
    ]

  }
}
